load.yaml
config:
  target: "{{ $processEnvironment.TARGET_URL }}"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 30
      arrivalRate: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 20
      name: Spike phase
    - duration: 120
      arrivalRate: 2
      name: Slow phase
scenarios:
  - flow:
      - get:
          url: "/customer/{{ $randomNumber(10000, 99999) }}/accounts"