load.yaml
config:
  target: http://localhost:8080
  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 10
      name: Ramp up load
    - duration: 60
      arrivalRate: 25
      name: Spike phase
    - duration: 120
      arrivalRate: 2
      name: Slow phase
scenarios:
  - flow:
      - get:
          url: "/test"